# View Position Get Placed Viewport Ids For View Position Method

Source: https://www.revitapidocs.com/2026/d6ebf176-abab-ac58-5ada-c8098991bc6c.htm

---

| View Position Get Placed Viewport Ids For View Position Method |
| --- |

Gets the placed viewport ids for the view position.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public IList<ElementId> GetPlacedViewportIdsForViewPosition()
```

```
Public Function GetPlacedViewportIdsForViewPosition As IList(Of ElementId)
```

```
public:
IList<ElementId^>^ GetPlacedViewportIdsForViewPosition()
```

```
member GetPlacedViewportIdsForViewPosition : unit -> IList<ElementId>
```

#### Return Value

IList ElementId
The placed viewport ids for the view position. See Also

#### Reference

ViewPosition Class Autodesk.Revit.DB Namespace